app/controllers/blog_comments_controller.rb

  def create
    @post = BlogPost.find(params[:blog_post_id])
    @comment = @post.blog_comments.create!(params[:blog_comment])
---
SELECT * FROM `blog_posts` WHERE (`blog_posts`.`id` = 2)
INSERT INTO `blog_comments` (`created_at`, `body`, `updated_at`, `user_id`, `blog_post_id`) VALUES('2010-05-13 19:30:22', NULL, '2010-05-13 19:30:22', NULL, NULL)