app/controllers/blog_posts_controller.rb

SELECT * FROM `blog_posts` ORDER BY created_at DESC LIMIT 0, 1
---
  def index
    @blog_posts = BlogPost.all(:order => "created_at DESC")

SELECT * FROM `blog_posts` WHERE (`blog_posts`.`id` = 1)
---
  def show
    @blog_post = BlogPost.find(params[:id])

INSERT INTO `blog_posts` (`created_at`, `title`, `body`, `updated_at`, `user_id`) VALUES('2010-04-19 19:35:05', 'A new Arcath.net', 'Arcath.net is changing!\r\n\r\nAll of the anet sites are now going to amalgamate in to one large rails app. This app is going to use subdomain-fu to change the default location and functionality of the site. ', '2010-04-19 19:35:05', 1)
---
  def create
    @blog_post = BlogPost.new(params[:blog_post])
    if @blog_post.save

SELECT * FROM `blog_posts` WHERE (`blog_posts`.`id` = 1)
---
  def edit
    @blog_post = BlogPost.find(params[:id])

SELECT * FROM `blog_posts` WHERE (`blog_posts`.`id` = 2)
UPDATE `blog_posts` SET `updated_at` = '2010-04-24 12:11:01', `body` = 'For Arcath.net I have created a custom fork of CanCan, the authorization plugin written by Ryan Bates. The big difference between the original version and my version of CanCan is how you write your Ability.rb file. In the original version your ability file looks something like this:\r\n\r\n[code lang=ruby]class Ability\r\n include CanCan::Ability\r\n def initialize(user)\r\n if user.admin?\r\n can :manage, :all\r\n else\r\n can :read, :all\r\n end\r\n end\r\nend[/code]\r\n\r\nAs you can see you put all your logic in the initialize method, and thats about it, its a very easy plugin to use.\r\n\r\nBut my issue with it is that you have to use a huge if statement if you have a large number of roles and allot of controllers. I thought it would be allot better if its definitions works like those of declarative authorization, where you have a \"method\" for every role and all the definitions are in those methods.\r\n\r\nMy Alterations now mean that the ability.rb file looks like this:\r\n\r\n[code lang=ruby]class Ability\r\n include CanCan::Ability\r\n def role\r\n @user.role\r\n end\r\n \r\n def guest\r\n can :read, all\r\n end\r\n\r\n def admin\r\n based_on :guest\r\n can :manage, :all\r\n end\r\nend[/code]' WHERE `id` = 2
---
  def update
    @blog_post = BlogPost.find(params[:id])
    if @blog_post.update_attributes(params[:blog_post])