app/controllers/projects_controller.rb

  def index
    @projects = Project.all(:order => "name ASC")
---
SELECT * FROM `projects` ORDER BY name DESC

  def show
    @project = Project.find(params[:id])
    @posts = Tag.find_by_name(@project.name.gsub(" ","")).blog_posts if Tag.find_by_name(@project.name.gsub(" ",""))
---
SELECT * FROM `projects` WHERE (`projects`.`id` = 1)
SELECT * FROM `tags` WHERE (`tags`.`name` = 'Arcath.net') LIMIT 1

  def create
    @project = Project.new(params[:project])
    if @project.save
---
INSERT INTO `projects` (`name`, `git_repo`, `created_at`, `git_user`, `updated_at`, `description`) VALUES('Rake Tasks', 'Rake-Tasks', '2010-05-30 14:21:58', 'Arcath', '2010-05-30 14:21:58', '...')

  def update
    @project = Project.find(params[:id])
    if @project.update_attributes(params[:project])
---
SELECT * FROM `projects` WHERE (`projects`.`id` = 1)
UPDATE `projects` SET `updated_at` = '2010-05-30 14:54:48', `description` = 'These are the Rake tasks I wrote to make my life easier.' WHERE `id` = 2