app/controllers/usages_controller.rb

SELECT * FROM `usages` WHERE (created_at <= '2010-05-02 15:58:28') ORDER BY created_at DESC LIMIT 30
---
  def index
    @usages = Usage.all(:order => "created_at DESC", :limit => 30)